redisTestResult/redisMutiThreadsTestResult/redis_test_result_by_memtier_benchmark_FM_OFF_1nd/redis_result_Gauss110_FM_OFF_P1_1nd_20230717172722.log
20        Threads
5         Connections per thread
40        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        28435.49          ---          ---         3.19412         3.11900         6.33500         6.87900     30545.07 
Gets         2842.22      2842.22         0.00         3.18599         3.11900         6.30300         6.81500      3039.20 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      31277.70      2842.22         0.00         3.19339         3.11900         6.33500         6.84700     33584.27 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.127        0.000
SET       2.783        5.000
SET       2.847       10.000
SET       2.895       15.000
SET       2.927       20.000
SET       2.959       25.000
SET       2.991       30.000
SET       3.023       35.000
SET       3.055       40.000
SET       3.087       45.000
SET       3.119       50.000
SET       3.135       52.500
SET       3.135       55.000
SET       3.151       57.500
SET       3.167       60.000
SET       3.167       62.500
SET       3.183       65.000
SET       3.199       67.500
SET       3.215       70.000
SET       3.215       72.500
SET       3.231       75.000
SET       3.247       76.250
SET       3.247       77.500
SET       3.263       78.750
SET       3.263       80.000
SET       3.279       81.250
SET       3.279       82.500
SET       3.295       83.750
SET       3.311       85.000
SET       3.327       86.250
SET       3.343       87.500
SET       3.343       88.125
SET       3.359       88.750
SET       3.359       89.375
SET       3.375       90.000
SET       3.391       90.625
SET       3.407       91.250
SET       3.439       91.875
SET       3.471       92.500
SET       3.519       93.125
SET       3.567       93.750
SET       3.599       94.062
SET       3.631       94.375
SET       3.663       94.688
SET       3.711       95.000
SET       3.775       95.312
SET       4.031       95.625
SET       4.351       95.938
SET       4.543       96.250
SET       4.671       96.562
SET       4.927       96.875
SET       5.407       97.031
SET       5.599       97.188
SET       5.727       97.344
SET       5.791       97.500
SET       5.855       97.656
SET       5.919       97.812
SET       5.983       97.969
SET       6.047       98.125
SET       6.111       98.281
SET       6.175       98.438
SET       6.207       98.516
SET       6.207       98.594
SET       6.239       98.672
SET       6.271       98.750
SET       6.271       98.828
SET       6.303       98.906
SET       6.335       98.984
SET       6.335       99.062
SET       6.367       99.141
SET       6.399       99.219
SET       6.399       99.258
SET       6.399       99.297
SET       6.431       99.336
SET       6.431       99.375
SET       6.431       99.414
SET       6.463       99.453
SET       6.463       99.492
SET       6.495       99.531
SET       6.495       99.570
SET       6.527       99.609
SET       6.527       99.629
SET       6.527       99.648
SET       6.559       99.668
SET       6.559       99.688
SET       6.591       99.707
SET       6.591       99.727
SET       6.623       99.746
SET       6.623       99.766
SET       6.655       99.785
SET       6.655       99.805
SET       6.687       99.814
SET       6.687       99.824
SET       6.719       99.834
SET       6.719       99.844
SET       6.751       99.854
SET       6.751       99.863
SET       6.783       99.873
SET       6.815       99.883
SET       6.847       99.893
SET       6.879       99.902
SET       6.911       99.907
SET       6.943       99.912
SET       6.943       99.917
SET       6.975       99.922
SET       7.007       99.927
SET       7.071       99.932
SET       7.071       99.937
SET       7.103       99.941
SET       7.135       99.946
SET       7.167       99.951
SET       7.199       99.954
SET       7.199       99.956
SET       7.231       99.958
SET       7.231       99.961
SET       7.263       99.963
SET       7.263       99.966
SET       7.295       99.968
SET       7.295       99.971
SET       7.327       99.973
SET       7.359       99.976
SET       7.359       99.977
SET       7.359       99.978
SET       7.391       99.979
SET       7.391       99.980
SET       7.423       99.982
SET       7.423       99.983
SET       7.455       99.984
SET       7.487       99.985
SET       7.487       99.987
SET       7.519       99.988
SET       7.551       99.988
SET       7.583       99.989
SET       7.583       99.990
SET       7.615       99.990
SET       7.615       99.991
SET       7.647       99.991
SET       7.743       99.992
SET       7.775       99.993
SET       8.031       99.993
SET       8.255       99.994
SET       8.255       99.994
SET       8.319       99.995
SET       8.447       99.995
SET       8.575       99.995
SET       8.831       99.995
SET       8.831       99.996
SET       8.959       99.996
SET       9.151       99.996
SET       9.407       99.997
SET       9.791       99.997
SET       9.919       99.997
SET       9.983       99.997
SET      10.047       99.997
SET      10.175       99.998
SET      10.175       99.998
SET      10.239       99.998
SET      10.431       99.998
SET      10.687       99.998
SET      10.687       99.998
SET      10.879       99.998
SET      10.879       99.999
SET      10.943       99.999
SET      10.943       99.999
SET      10.943       99.999
[...]
SET      11.007       99.999
SET      11.135       99.999
SET      12.543       99.999
SET      12.543       99.999
SET      13.119       99.999
SET      13.119       99.999
SET      17.407       99.999
SET      17.407       99.999
SET      17.407       99.999
[...]
SET      17.407      100.000
SET      17.407      100.000
SET      17.407      100.000
[...]
SET      19.967      100.000
SET      19.967      100.000
SET      19.967      100.000
[...]
SET      20.095      100.000
SET      20.095      100.000
---
GET       0.751        0.000
GET       2.783        5.000
GET       2.847       10.000
GET       2.895       15.000
GET       2.927       20.000
GET       2.959       25.000
GET       2.991       30.000
GET       3.023       35.000
GET       3.055       40.000
GET       3.087       45.000
GET       3.119       50.000
GET       3.119       52.500
GET       3.135       55.000
GET       3.151       57.500
GET       3.167       60.000
GET       3.167       62.500
GET       3.183       65.000
GET       3.199       67.500
GET       3.199       70.000
GET       3.215       72.500
GET       3.231       75.000
GET       3.247       76.250
GET       3.247       77.500
GET       3.247       78.750
GET       3.263       80.000
GET       3.263       81.250
GET       3.279       82.500
GET       3.295       83.750
GET       3.295       85.000
GET       3.311       86.250
GET       3.327       87.500
GET       3.343       88.125
GET       3.343       88.750
GET       3.359       89.375
GET       3.375       90.000
GET       3.391       90.625
GET       3.407       91.250
GET       3.423       91.875
GET       3.439       92.500
GET       3.471       93.125
GET       3.519       93.750
GET       3.551       94.062
GET       3.583       94.375
GET       3.615       94.688
GET       3.647       95.000
GET       3.695       95.312
GET       3.791       95.625
GET       4.127       95.938
GET       4.415       96.250
GET       4.607       96.562
GET       4.767       96.875
GET       4.991       97.031
GET       5.471       97.188
GET       5.631       97.344
GET       5.727       97.500
GET       5.823       97.656
GET       5.887       97.812
GET       5.951       97.969
GET       6.015       98.125
GET       6.079       98.281
GET       6.143       98.438
GET       6.175       98.516
GET       6.207       98.594
GET       6.239       98.672
GET       6.239       98.750
GET       6.271       98.828
GET       6.303       98.906
GET       6.303       98.984
GET       6.335       99.062
GET       6.367       99.141
GET       6.367       99.219
GET       6.399       99.258
GET       6.399       99.297
GET       6.399       99.336
GET       6.431       99.375
GET       6.431       99.414
GET       6.463       99.453
GET       6.463       99.492
GET       6.463       99.531
GET       6.495       99.570
GET       6.495       99.609
GET       6.527       99.629
GET       6.527       99.648
GET       6.559       99.668
GET       6.559       99.688
GET       6.559       99.707
GET       6.591       99.727
GET       6.591       99.746
GET       6.623       99.766
GET       6.623       99.785
GET       6.655       99.805
GET       6.655       99.814
GET       6.687       99.824
GET       6.687       99.834
GET       6.687       99.844
GET       6.719       99.854
GET       6.719       99.863
GET       6.751       99.873
GET       6.783       99.883
GET       6.783       99.893
GET       6.815       99.902
GET       6.847       99.907
GET       6.879       99.912
GET       6.879       99.917
GET       6.911       99.922
GET       6.943       99.927
GET       6.975       99.932
GET       7.007       99.937
GET       7.039       99.941
GET       7.071       99.946
GET       7.103       99.951
GET       7.135       99.954
GET       7.135       99.956
GET       7.135       99.958
GET       7.167       99.961
GET       7.199       99.963
GET       7.199       99.966
GET       7.199       99.968
GET       7.231       99.971
GET       7.263       99.973
GET       7.263       99.976
GET       7.327       99.977
GET       7.359       99.978
GET       7.359       99.979
GET       7.391       99.980
GET       7.391       99.982
GET       7.423       99.983
GET       7.423       99.984
GET       7.487       99.985
GET       7.519       99.987
GET       7.519       99.988
GET       7.519       99.988
GET       7.551       99.989
GET       7.583       99.990
GET       7.583       99.990
GET       7.679       99.991
GET       7.775       99.991
GET       7.775       99.992
GET       8.319       99.993
GET       8.383       99.993
GET       8.383       99.994
GET       8.383       99.994
GET       8.383       99.995
GET       8.447       99.995
GET       8.447       99.995
GET       8.447       99.995
GET       8.511       99.996
GET       8.511       99.996
GET       8.511       99.996
GET      10.047       99.997
GET      10.047       99.997
GET      10.047       99.997
[...]
GET      10.303       99.997
GET      10.303       99.998
GET      10.303       99.998
GET      10.303       99.998
[...]
GET      17.407       99.998
GET      17.407       99.998
GET      17.407       99.999
GET      17.407       99.999
GET      17.407       99.999
[...]
GET      19.967       99.999
GET      19.967      100.000
---
WAIT      0.000      100.000